"""
Модуль определяет базовый класс и физические свойства человека.

Полный словесный портрет содержит следующие сведения:

Анатомические (общефизические) признаки характеризуют собственно тело человека и включают пол, возраст, расовый тип, рост, комплекцию, относительные размеры основных частей тела, особенности строения частей тела, такие как, например, форма ушной раковины.
Функциональные признаки описывают особенности, проявляющиеся в движении, такие как походка, осанка, мимика, привычная жестикуляция, особенности произношения.
Особые приметы описывают те анатомические или функциональные признаки, которые резко индивидуальны или характерны для относительно небольшого числа людей, такие как явные врождённые или приобретённые уродства, шрамы, бородавки, татуировки, отсутствие частей тела, явная несоразмерность парных частей тела (например, резко различающаяся длина ног), заметная хромота.
Дополнительные внешние признаки, такие как одежда, украшения, носимые аксессуары (очки, зонт, трость, сумочка), манера носить одежду, соответствие размеров одежды размерам тела и прочее.


Порядок описания словесного портрета идёт по принципу «от общего к частному», от организма в целом к отдельным деталям. Максимально подробно описывается голова, отдельно — лицо. Сначала описываются анатомические признаки, затем функциональные, отдельно — особые приметы, последними — дополнительные.
"""

# an_simulation_synapse

#Human Physical Model